Revit 2027 API
SketchedStairsCurveData Constructor
 Construct a SketchedStairsCurveData defined by a curve associated with its height and slope type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SketchedStairsCurveData(
	Curve boundaryCurve,
	double height,
	SketchedCurveSlopeOption slopeType
)
Public Sub New (
	boundaryCurve As Curve,
	height As Double,
	slopeType As SketchedCurveSlopeOption
)
public:
SketchedStairsCurveData(
	Curve^ boundaryCurve,
	double height,
	SketchedCurveSlopeOption slopeType
)
new :
        boundaryCurve : Curve *
        height : float *
        slopeType : SketchedCurveSlopeOption -> SketchedStairsCurveData
Parameters
boundaryCurve Curve
height Double
slopeType SketchedCurveSlopeOption
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SketchedStairsCurveData Class
Autodesk.Revit.DB Namespace